riot-ci/RIOT/cpu/stm32/include/periph_cpu.h
#if defined(CPU_FAM_STM32F0) || defined(CPU_FAM_STM32F3) || \
    defined(CPU_FAM_STM32F7) || defined(CPU_FAM_STM32L0) || \
    defined(CPU_FAM_STM32L4) || defined(CPU_FAM_STM32WB) || \
    defined(CPU_FAM_STM32G4) || defined(CPU_FAM_STM32G0)
/**
 * @brief   Structure for I2C timing register settings
 *
 * These parameters are valid for 48MHz (16MHz for L0) input clock.
 * See reference manual of supported CPU for example of timing settings:
 * - STM32F030/F070: see RM0360, section 22.4.10, p.560, table 76
 * - STM32F303: see RM0316, section 28.4.9, p.849, table 148
 * - STM32F72X: see RM0431, section 26.4.9, p.851, table 149
 * - STM32L0x2: see RM0376, section 27.4.10, p.686, table 117
 * - STM32L4X5/6: see RM0351, section 39.4.9, p.1297, table 234
 */
typedef struct {
    uint8_t presc;          /**< Timing prescaler value */
    uint8_t scll;           /**< SCL Low period */
    uint8_t sclh;           /**< SCL High period */
    uint8_t sdadel;         /**< Data hold time */
    uint8_t scldel;         /**< Data setup time */
} i2c_timing_param_t;
#endif

/**
 * @brief USB OTG peripheral type.
 *
 * High speed peripheral is assumed to have DMA support available.
 *
 * @warning Only one of each type is supported at the moment, it is not
 * supported to have two FS type or two HS type peripherals enabled on a
 * single MCU.
 */
typedef enum {
    STM32_USB_OTG_FS = 0,   /**< Full speed peripheral */
    STM32_USB_OTG_HS = 1,   /**< High speed peripheral */
} stm32_usb_otg_fshs_type_t;

/**
 * @brief Type of USB OTG peripheral phy.
 *
 * The FS type only supports the built-in type, the HS phy can have either the
 * FS built-in phy enabled or the HS ULPI interface enabled.
 */
typedef enum {
    STM32_USB_OTG_PHY_BUILTIN,
    STM32_USB_OTG_PHY_ULPI,
} stm32_usb_otg_fshs_phy_t;

/**
 * @brief stm32 USB OTG configuration
 */
typedef struct {
    uint8_t *periph;                /**< USB peripheral base address */
    uint32_t rcc_mask;              /**< bit in clock enable register */
    stm32_usb_otg_fshs_phy_t phy;   /**< Built-in or ULPI phy */
    stm32_usb_otg_fshs_type_t type; /**< FS or HS type */
    uint8_t irqn;                   /**< IRQ channel */
    uint8_t ahb;                    /**< AHB bus */
    gpio_t dm;                      /**< Data- gpio */
    gpio_t dp;                      /**< Data+ gpio */
    gpio_af_t af;                   /**< Alternative function */
} stm32_usb_otg_fshs_config_t;

/**
 * @brief   Get the actual bus clock frequency for the APB buses
 *
 * @param[in] bus       target APBx bus
 *
 * @return              bus clock frequency in Hz
 */
uint32_t periph_apb_clk(uint8_t bus);

/**
 * @brief   Get the actual timer clock frequency
 *
 * @param[in] bus       corresponding APBx bus
 *
 * @return              timer clock frequency in Hz
 */
uint32_t periph_timer_clk(uint8_t bus);

/**
 * @brief   Enable the given peripheral clock
 *
 * @param[in] bus       bus the peripheral is connected to
 * @param[in] mask      bit in the RCC enable register
 */
void periph_clk_en(bus_t bus, uint32_t mask);

/**
 * @brief   Disable the given peripheral clock
 *
 * @param[in] bus       bus the peripheral is connected to
 * @param[in] mask      bit in the RCC enable register
 */
void periph_lpclk_dis(bus_t bus, uint32_t mask);

/**
 * @brief   Enable the given peripheral clock in low power mode
 *
 * @param[in] bus       bus the peripheral is connected to
 * @param[in] mask      bit in the RCC enable register
 */
void periph_lpclk_en(bus_t bus, uint32_t mask);

/**
 * @brief   Disable the given peripheral clock in low power mode
 *
 * @param[in] bus       bus the peripheral is connected to
 * @param[in] mask      bit in the RCC enable register
 */
void periph_clk_dis(bus_t bus, uint32_t mask);

/**
 * @brief   Configure the alternate function for the given pin
 *
 * @param[in] gpio      gpio to configure
 * @param[in] af        alternate function to use
 */
void gpio_init_af(gpio_t gpio, gpio_af_t af);

/**
 * @brief   Configure the given pin to be used as ADC input
 *
 * @param[in] gpio      gpio to configure
 */
void gpio_init_analog(gpio_t gpio);

#ifdef MODULE_PERIPH_DMA
/**
 * @brief   DMA stream not defined
 */
#define DMA_STREAM_UNDEF (UINT_MAX)

/**
 * @brief   Initialize DMA
 */
void dma_init(void);

/**
 * @brief   Execute a DMA transfer
 *
 * This function blocks until the transfer is completed. This is a convenience
 * function which configure, start, wait and stop a DMA transfer.
 *
 * @param[in]  dma     logical DMA stream
 * @param[in]  chan    DMA channel (on stm32f2/4/7, CxS or unused on others)
 * @param[in]  src     source buffer
 * @param[out] dst     destination buffer
 * @param[in]  len     length to transfer
 * @param[in]  mode    DMA mode
 * @param[in]  flags   DMA configuration
 *
 * @return < 0 on error, the number of transferred bytes otherwise
 */
int dma_transfer(dma_t dma, int chan, const volatile void *src, volatile void *dst, size_t len,
                 dma_mode_t mode, uint8_t flags);

/**
 * @brief   Acquire a DMA stream
 *
 * @param[in] dma     logical DMA stream
 */
void dma_acquire(dma_t dma);

/**
 * @brief   Release a DMA stream
 *
 * @param[in] dma     logical DMA stream
 */
void dma_release(dma_t dma);

/**
 * @brief   Start a DMA transfer on a stream
 *
 * Start a DMA transfer on a given stream. The stream must be configured first
 * by a @p dma_configure call.
 *
 * @param[in] dma     logical DMA stream
 */
void dma_start(dma_t dma);

/**
 * @brief   Suspend a DMA transfer on a stream
 *
 * @param[in] dma     logical DMA stream
 *
 * @return the remaining number of bytes to transfer
 */
uint16_t dma_suspend(dma_t dma);

/**
 * @brief   Resume a suspended DMA transfer on a stream
 *
 * @param[in] dma         logical DMA stream
 * @param[in] reamaining  the remaining number of bytes to transfer
 */
void dma_resume(dma_t dma, uint16_t remaining);

/**
 * @brief   Stop a DMA transfer on a stream
 *
 * @param[in] dma     logical DMA stream
 */
void dma_stop(dma_t dma);

/**
 * @brief   Wait for the end of a transfer
 *
 * @param[in] dma     logical DMA stream
 */
void dma_wait(dma_t dma);

/**
 * @brief   Configure a DMA stream for a new transfer
 *
 * @param[in]  dma     logical DMA stream
 * @param[in]  chan    DMA channel (on stm32f2/4/7, CxS or unused on others)
 * @param[in]  src     source buffer
 * @param[out] dst     destination buffer
 * @param[in]  len     length to transfer
 * @param[in]  mode    DMA mode
 * @param[in]  flags   DMA configuration
 *
 * @return < 0 on error, 0 on success
 */
int dma_configure(dma_t dma, int chan, const volatile void *src, volatile void *dst, size_t len,
                  dma_mode_t mode, uint8_t flags);

/**
 * @brief   Low level initial DMA stream configuration
 *
 * This function is supposed to be used together with @ref dma_prepare. This
 * function sets up the one-time configuration of a stream and @ref dma_prepare
 * configures the per-transfer registers.
 *
 * @param[in]   dma         Logical DMA stream
 * @param[in]   chan        DMA channel (on stm32f2/4/7, CxS or unused on others)
 * @param[in]   periph_addr Peripheral register address
 * @param[in]   mode        DMA direction mode
 * @param[in]   width       DMA transfer width
 * @param[in]   inc_periph  Increment peripheral address after read/write
 */
void dma_setup(dma_t dma, int chan, void *periph_addr, dma_mode_t mode,
               uint8_t width, bool inc_periph);

/**
 * @brief   Low level DMA transfer configuration
 *
 * @param[in]   dma         Logical DMA stream
 * @param[in]   mem         Memory address
 * @param[in]   len         Transfer length
 * @param[in]   inc_mem     Increment the memory address after read/write
 */
void dma_prepare(dma_t dma, void *mem, size_t len, bool incr_mem);

#endif /* MODULE_PERIPH_DMA */

#ifdef MODULE_PERIPH_CAN
#include "candev_stm32.h"
#endif

/**
 * @brief STM32 Ethernet configuration mode
 */
typedef enum {
    MII  = 18,                       /**< Configuration for MII */
    RMII = 9,                       /**< Configuration for RMII */
    SMI  = 2,                        /**< Configuration for SMI */
} eth_mode_t;

/**
 * @brief STM32 Ethernet speed options
 */
typedef enum {
    ETH_SPEED_10T_HD   = 0x0000,
    ETH_SPEED_10T_FD   = 0x0100,
    ETH_SPEED_100TX_HD = 0x2000,
    ETH_SPEED_100TX_FD = 0x2100,
} eth_speed_t;

/**
 * @brief   Ethernet Peripheral configuration
 */
typedef struct {
    eth_mode_t mode;      /**< Select configuration mode */
    char mac[6];                /**< Ethernet MAC address */
    eth_speed_t speed;    /**< Speed selection */
    uint8_t dma;                /**< Locical CMA Descriptor used for TX */
    uint8_t dma_chan;           /**< DMA channel used for TX */
    char phy_addr;              /**< PHY address */
    gpio_t pins[];              /**< Pins to use. MII requires 18 pins,
                                        RMII 9 and SMI 9. Not all speeds are
                                        supported by all modes. */
} eth_conf_t;

/**
* @name Ethernet PHY Common Registers
* @{
*/
#define PHY_BMCR                           (0x00)
#define PHY_BSMR                           (0x01)
#define PHY_PHYIDR1                        (0x02)
#define PHY_PHYIDR2                        (0x03)
#define PHY_ANAR                           (0x04)
#define PHY_ANLPAR                         (0x05)
#define PHY_ANER                           (0x06)
#define PHY_ANNPTR                         (0x07)
/** @} */

/**
* @name Ethernet PHY BMCR Fields
* @{
*/
#define BMCR_RESET                         (0x8000)
#define BMCR_LOOPBACK                      (0x4000)
#define BMCR_SPEED_SELECT                  (0x2000)
#define BMCR_AN                            (0x1000)
#define BMCR_POWER_DOWN                    (0x0800)
#define BMCR_ISOLATE                       (0x0400)
#define BMCR_RESTART_AN                    (0x0200)
#define BMCR_DUPLEX_MODE                   (0x0100)
#define BMCR_COLLISION_TEST                (0x0080)
/** @} */

/**
* @name Ethernet PHY BSMR Fields
* @{
*/
#define BSMR_100BASE_T4                    (0x8000)
#define BSMR_100BASE_TX_FDUPLEX            (0x4000)
#define BSMR_100BASE_TX_HDUPLEX            (0x2000)
#define BSMR_10BASE_T_FDUPLEX              (0x1000)
#define BSMR_10BASE_T_HDUPLEX              (0x0800)
#define BSMR_NO_PREAMBLE                   (0x0040)
#define BSMR_AN_COMPLETE                   (0x0020)
#define BSMR_REMOTE_FAULT                  (0x0010)
#define BSMR_AN_ABILITY                    (0x0008)
#define BSMR_LINK_STATUS                   (0x0004)
#define BSMR_JABBER_DETECT                 (0x0002)
#define BSMR_EXTENDED_CAP                  (0x0001)
/** @} */

/**
* @name Ethernet PHY PHYIDR1 Fields
*/
#define PHYIDR1_OUI                        (0xffff)

/**
* @name Ethernet PHY PHYIDR2 Fields
* @{
*/
#define PHYIDR2_OUI                        (0xfe00)
#define PHYIDR2_MODEL                      (0x01f0)
#define PHYIDR2_REV                        (0x0007)
/** @} */

/**
* @name Ethernet PHY ANAR Fields
* @{
*/
#define ANAR_NEXT_PAGE                     (0x8000)
#define ANAR_REMOTE_FAULT                  (0x2000)
#define ANAR_PAUSE                         (0x0600)
#define ANAR_100BASE_T4                    (0x0200)
#define ANAR_100BASE_TX_FDUPLEX            (0x0100)
#define ANAR_100BASE_TX_HDUPLEX            (0x0080)
#define ANAR_10BASE_T_FDUPLEX              (0x0040)
#define ANAR_10BASE_T_HDUPLEX              (0x0020)
#define ANAR_SELECTOR                      (0x000f)
/** @} */

/**
* @name Ethernet PHY ANLPAR Fields
* @{
*/
#define ANLPAR_NEXT_PAGE                   (0x8000)
#define ANLPAR_ACK                         (0x4000)
#define ANLPAR_REMOTE_FAULT                (0x2000)
#define ANLPAR_PAUSE                       (0x0600)
#define ANLPAR_100BASE_T4                  (0x0200)
#define ANLPAR_100BASE_TX_FDUPLEX          (0x0100)
#define ANLPAR_100BASE_TX_HDUPLEX          (0x0080)
#define ANLPAR_10BASE_T_FDUPLEX            (0x0040)
#define ANLPAR_10BASE_T_HDUPLEX            (0x0020)
#define ANLPAR_SELECTOR                    (0x000f)
/** @} */

/**
* @name Ethernet PHY ANNPTR Fields
* @{
*/
#define ANNPTR_NEXT_PAGE                   (0x8000)
#define ANNPTR_MSG_PAGE                    (0x2000)
#define ANNPTR_ACK2                        (0x1000)
#define ANNPTR_TOGGLE_TX                   (0x0800)
#define ANNPTR_CODE                        (0x03ff)
/** @} */

/**
* @name Ethernet PHY ANER Fields
* @{
*/
#define ANER_PDF                           (0x0010)
#define ANER_LP_NEXT_PAGE_ABLE             (0x0008)
#define ANER_NEXT_PAGE_ABLE                (0x0004)
#define ANER_PAGE_RX                       (0x0002)
#define ANER_LP_AN_ABLE                    (0x0001)
/** @} */

#ifdef MODULE_STM32_ETH
/**
 * @brief Read a PHY register
 *
 * @param[in] addr      address of the PHY to read
 * @param[in] reg       register to be read
 *
 * @return value in the register, or <=0 on error
 */
int32_t stm32_eth_phy_read(uint16_t addr, uint8_t reg);

/**
 * @brief Write a PHY register
 *
 * @param[in] addr      address of the PHY to write
 * @param[in] reg       register to be written
 * @param[in] value     value to write into the register
 *
 * @return 0 in case of success or <=0 on error
 */
int32_t stm32_eth_phy_write(uint16_t addr, uint8_t reg, uint16_t value);
#endif /* MODULE_STM32_ETH */

#ifdef __cplusplus
}
#endif

#endif /* PERIPH_CPU_H */
/** @} */
